#ifndef _LOG_FORMAT_MACRO_H_
#define _LOG_FORMAT_MACRO_H_

//运维文本类日志标准格式
//"%d" 时间
//"%d" 微观时间
//"%d" 本机IP
//"%d" 本机端口
//"%d" 对端IP
//"%d" 对端端口
//"%s" 协议
//"%d" 计数器
//"%s" 源文件
//"%d" 行数
//"%d" 返回值
//"%s" 内容
#define MAINTENANCE_TEXT_LOG_FORMAT \
	"[%s]" \
	"[%d]" \
	"[%d]" \
	"[%d]" \
	"[%d]" \
	"[%d]" \
	"[%s]" \
	"[%d]" \
	"[%s]" \
	"[%d]" \
	"[%d]" \
	"[%s]"

// 运维监控类模块间调用日志标准格式
//"%d" 主调模块ID
//"%d" 被调模块ID
//"%d" 被调模块接口ID
//"%d" 主调模块IP
//"%d" 被调模块IP
//"%d" 主调模块端口
//"%d" 被调模块端口
//"%s" 主调模块文件名
//"%d" 主调模块行号
//"%s" 主调模块文件创建时间
//"%s" 操作类型
//"%d" 返回值
//"%d" 调用结果
//"%d" 调用响应时间
//"%d" 扩展字段1
//"%d" 扩展字段2
//"%d" 扩展字段3
//"%d" 扩展字段4
//"%d" 扩展字段5
//"%s" 扩展字段6
//"%s" 扩展字段7
//"%s" 扩展字段8
//"%s" 扩展字段9
//"%s" 扩展字段10
#define MAINTENANCE_MONITOR_MODULE_INTERFACE_LOG_FORMAT \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%s" \
	"%d" \
	"%s" \
	"%s" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%d" \
	"%s" \
	"%s" \
	"%s" \
	"%s" \
	"%s"

#endif // _LOG_FORMAT_MACRO_H_
